# сегментація зображень
from ultralytics import YOLO
import numpy as np
import cv2

# модель для сегментації - виділення по пікселям обʼєкту
# Створюється об'єкт моделі YOLO.
# Це модель сегментації (segmentation), яка вміє:
# знаходити об'єкти;
# визначати їхній клас;
# будувати маску (контур) кожного об'єкта.
model = YOLO("yolo11s-seg.pt")

# #OpenCV читає зображення з диска.
# # Результат зберігається у змінній img.
# # Це тривимірний масив NumPy.
# img = cv2.imread("data/lesson_seg/human.jpg")
# cv2.imshow("orig", img) # Відкриває вікно з назвою "orig" та показує оригінальне зображення.
# print(img.shape) # 400 — висота; # 600 — ширина; # 3 — канали BGR.
#
# # # застосування моделі - модель аналізує зображення.
# results = model.predict(
#     img, #саме зображення.
#     device="mps", #означає використовувати GPU Apple (Metal Performance Shaders).
# )
# # results -- список результатів для кожного зображення
# # # дістати результати для першого(єдиного) зображення
# #Після виконання модель знаходить:
# # людей;
# # машини;
# # собак;
# # котів;
# # інші класи.
# #
# # Оскільки це segmentation-модель, вона також будує маски.
# result = results[0]
# print(result) #Беремо перший елемент списку.
# # Тепер у result міститься вся інформація:
# # бокси;
# # маски;
# # класи;
# # ймовірності.
#
# # візуалізація результату Метод plot():
# # малює рамки;
# # підписує клас;
# # малює маски.
#
# res_img = result.plot()
# cv2.imshow("res", res_img) # Повертає вже нове зображення.
#
# # маски об'єктів
# masks = result.masks #Беремо всі маски знайдених об'єктів.
# print(masks)
#
# # класи об'єктів
# boxes = result.boxes #Беремо інформацію про прямокутники. координати; класи; ймовірності.
# print(boxes)
#
# # назви класів
# print(boxes.cls) #cls — це номери класів. до кожного номера є назва класу tensor([0.]) - 0:person
#
# # де знаходиться людина. Беремо самі маски у вигляді тензора PyTorch.
# masks_data = masks.data
#
# # маска людини
# #Беремо маску першого об'єкта. Якщо знайдена лише людина — це її маска.
# human_mask = masks_data[0]
#
# # # переведення маски у формат opencv: Тут відбуваються дві операції.
# # .cpu() : Переносить тензор з GPU у оперативну пам'ять процесора.
# #.numpy(): Перетворює PyTorch Tensor у NumPy-масив. OpenCV працює саме з NumPy.
# human_mask = human_mask.cpu().numpy()
#
# print(human_mask.shape)  # розмір не співпадає з оригінальним зображенням Бо YOLO працює зі зменшеними внутрішніми
# # картами ознак. Маски створюються у меншій роздільній здатності.
# print(human_mask.dtype) #float32
#
# # перевести в тип даних uint8
# human_mask = human_mask.astype(np.uint8)
#
# # там 0 та 1, мають бути 0 (чорний) та 255 (білий)
# human_mask *= 255
#
# # Змінюємо розмір маски до розміру оригінального зображення.
# # OpenCV очікує параметри у порядку: (width, height)
# human_mask = cv2.resize(human_mask, (600, 400)) #— ширина, — висота.
#
#
# #Відкривається окреме вікно.
# # На ньому:
# # білий колір (255) — пікселі, що належать людині;
# # чорний (0) — фон.
# cv2.imshow("mask", human_mask)


# відео
#Створює об'єкт VideoCapture, який дозволяє читати відео кадр за кадром.
# cap — це об'єкт для роботи з відео.
# "data/lesson8/cars+bikes.mp4" — шлях до відеофайлу.
cap = cv2.VideoCapture("data/lesson8/cars+bikes.mp4")  # відеокамера

# зображення фону - Зчитує зображення, яке буде використовуватися як новий фон.
background = cv2.imread("data/lesson4/canal.png") # це масив NumPy із пікселями картинки.

# отримати розміри зображення. Метод get() повертає властивість відео.
width = int(cap.get(cv2.CAP_PROP_FRAME_WIDTH)) #ширину кадру
height = int(cap.get(cv2.CAP_PROP_FRAME_HEIGHT)) #висоту

# Якщо фон має інший розмір, його потрібно привести до розміру кадру на відео. Інакше NumPy не зможе підставити фон.
background = cv2.resize(background, (width, height))

#Цикл працює доти, поки не закінчиться відео або користувач не натисне q
while True:
    success, frame = cap.read()

    if not success:
        break
    #Відкривається вікно із поточним кадром.
    cv2.imshow("orig", frame)

    # модель
    results = model.predict(
        frame,
        device="cpu"
    )

    #Модель аналізує кадр.Вона знаходить об'єкти та створює їхні маски.
    result = results[0] #Оскільки обробляється один кадр, беремо перший елемент.
    #На копії кадру модель малює:
    # рамки;
    # маски;
    # назви класів.
    #Потім цей кадр показується окремо.
    res = result.plot()

    # дістати маску
    masks = result.masks #Тут знаходяться всі маски знайдених об'єктів.
    masks_data = masks.data #містить тензор із масками. Наприклад, (3, 160, 160) де 3 — кількість знайдених об'єктів.

    # маска об'єкта з найвищою ймовірністю(людина в кадрі)
    human_mask = masks_data[0]

    # обробка маски(щоб намалюти)
    human_mask = human_mask.cpu().numpy() #Спочатку вона знаходиться у вигляді тензора PyTorch. Переводимо її в NumPy.
    human_mask = human_mask.astype(np.uint8)#Змінюємо тип даних.
    human_mask *= 255 # змінюємо 0 1 на 0 255
    human_mask = cv2.resize(human_mask, (width, height)) #Модель повертає маленьку маску.
    # Її збільшують до розміру кадру

    cv2.imshow("mask", human_mask) #Показ маски. Біле:людина Чорне: фон

    # заміна фону

    # маска має місти True або False ->  Перетворюємо маску в логічний тип.
    mask = human_mask.astype(bool) #255 → True  0 → False

    #frame[~mask] = background[~mask] # mask — людина. ~mask — усе, що не людина.
    # все що не людина замінити background, усі пікселі, де немає людини, замінити пікселями нового фону.

    # розмиття фону - Замість повної заміни фону використовується розмиття.
    blured_frame = cv2.GaussianBlur(frame, (51, 51), sigmaX=10) #Створюється копія кадру.
    # До неї застосовується розмиття Гаусса.
    # Параметри: (51, 51) — розмір ядра розмиття; sigmaX = 10 — сила розмиття.

    frame[~mask] = blured_frame[~mask] #усі пікселі фону взяти з розмитої копії. Людина залишається різкою.
    # Фон стає розмитим.

    cv2.imshow("with background", frame)

    cv2.imshow("res", res)

    if cv2.waitKey(1) & 0xFF == ord('q'):
        break

cap.release()
cv2.destroyAllWindows()


cv2.waitKey(0)