import dotenv
import os

from langchain_google_genai import ChatGoogleGenerativeAI
from langchain_core.messages import (
    HumanMessage,
    AIMessage,
    SystemMessage,
    trim_messages,
)

# завантажити дані з .env
dotenv.load_dotenv()

api_key = os.getenv("GEMINI_API_KEY")

# # модель
llm = ChatGoogleGenerativeAI(
    model="gemini-3.5-flash-lite",  # назва моделі
    api_key=api_key  # ключ до сервера з моделлю
)
# Завдання 1
# Напишіть чат бота, який спілкується у стилі різних
# персонажів книг\фільмів або відомих людей. Ким саме бути
# чат бот вирішує з повідомлення від користувача.
# Якщо персонаж або книга невідомі, то відповісти що
# невідома інформація та запропонувати декілька відомих
# прикладів на вибір

# # # історія повідомлень
# messages = [
#     # список усіх повідомлень в чаті
#     # на початку завжди йде SystemMessage -- з інструкціями для чатботу
#     SystemMessage("""
#     Ти -- чат бот який імітує спілкування з різними героями книг, казок, фільмів, мультфільмів
#     Твоя задача надавати відповіді користувачу в стилі, в залежності від героя
#
#     ###ІНСТРУКЦІЇ###
#     1. Відповіді мають бути короткими(до 2 речень)
#     2. Стиль відповідей залежить від героя
#     3. Якщо герой не відомий, відповісти, що не знаєш такого і запропонувати інші варінти на вибір
#
#     """),
#     #
#     # # всі наступні елементи в списку -- повідомлення від користувач та відповіді llm
#     # HumanMessage("Привіт"),
#     # AIMessage("Привіт, як справи?"),
#     # HumanMessage("Порекомендуй цікавий фільм"),
# ]
#
# while True:
#     # отримати повідомлення від користувача
#     user_text = input("Ви: ")
#
#     # перевірка для кінця спілкування
#     if user_text == "":
#         break
#
#     # створити HumanMessage
#     human_message = HumanMessage(content=user_text)
#
#     # додати повідемлення в історії
#     messages.append(human_message)
#
#     # отримати відповідь моделі
#     response = llm.invoke(messages)
#
#     # вивести на екран відповідь
#     print(f"AI: {response.content[0]['text']}")
#
#     # добавити response в історію спілкування
#     messages.append(response)


# Завдання 2
# Напишіть чат бота, який дає відповіді на питання
# стосовно умов повернення товару.
# Якщо користувач запитує щось інше, то відповідати що
# немає інформації.
# Застосуйте обмеження історії(можна десь 5 повідомлень)

# with open("data/lesson9/return_policy.txt", "r", encoding="utf-8") as file:
#     policy = file.read()
#     # print(policy)
#
#
# # # історія повідомлень
# messages = [
#     # список усіх повідомлень в чаті
#     # на початку завжди йде SystemMessage -- з інструкціями для чатботу
#     SystemMessage(f"""
#     Ти -- чат бот - консультант магазину,  який дає відповіді на питання стосовно умов повернення товару.
#
#     ###ІНСТРУКЦІЇ###
#     1. Відповіді мають бути короткими(до 2 речень)
#     2. Умови повернення товару зазначені в політиці
#     3. Якщо в політиці немає відповіді, і ти не знаєш що відповісти, не вигадуй
#     4. Нічого не вигадуй
#
#     ###ПРАВИЛА ПОВЕРНЕННЯ###
#     політика: {policy}
#
#     """),
# ]
#
# trimmer = trim_messages(
#     strategy='last',  # залишати останні повідомлення
#
#     token_counter=len,  # рахуємо кількість повідомлень
#     max_tokens=5,  # залишати максимум 5 повідомлення(System, AI, Human)
#
#     start_on='human',  # історія завжди починатиметься з HumanMessage
#     end_on='human',  # історія завжди закінчуватиметься з HumanMessage
#     include_system=True  # SystemMessage не чіпати
# )
#
#     #
#     # # всі наступні елементи в списку -- повідомлення від користувач та відповіді llm
#     # HumanMessage("Привіт"),
#     # AIMessage("Привіт, як справи?"),
#     # HumanMessage("Порекомендуй цікавий фільм"),
#
# while True:
#     # отримати повідомлення від користувача
#     user_text = input("Ви: ")
#
#     # перевірка для кінця спілкування
#     if user_text == "":
#         break
#
#     # створити HumanMessage
#     human_message = HumanMessage(content=user_text)
#
#     # додати повідемлення в історії
#     messages.append(human_message)
#
#     # очищення історії
#     messages = trimmer.invoke(messages)
#
#     # отримати відповідь моделі
#     response = llm.invoke(messages)
#
#     # вивести на екран відповідь
#     print(f"AI: {response.content[0]['text']}")
#
#     # добавити response в історію спілкування
#     messages.append(response)

# Завдання 3
# Напишіть чат бота, який допомагає у вивченні
# англійської мови з наступним функціоналом:
#  якщо користувач просить перекласти слово або фразу
# то дається переклад слова та приклад використання в
# реченні
#  якщо користувач просить перекласти речення, то
# Практичне завдання
# дається переклад самого речення, а також пояснення
# граматики, наприклад структура there is\are, питання в
# різних часових формах, тощо.
# Приклади реалізуйте як HumanMessage та AIMessage

# messages = [
#     # список усіх повідомлень в чаті
#     # на початку завжди йде SystemMessage -- з інструкціями для чатботу
#     SystemMessage(f"""
#     Ти -- досвідчений вчитель з англійської мови
#     Твоя задача - допомога у вивченні англійської мови
#
#     ###ІНСТРУКЦІЇ###
#     1. якщо користувач просить перекласти слово або фразу то дається переклад слова та приклад використання в  реченні
#     2.якщо користувач просить перекласти речення, то дається переклад самого речення, а також пояснення граматики,
#     наприклад, структура there is\are, питання в різних часових формах, тощо.
#     3. Пояснення роби коротко в 2-3 реченнях
#
#     """),
#     HumanMessage("""
#         Переклади слово Настрій
#     """),
#     AIMessage("""Ось переклад: Mood. Приклад використання: I have good mood today""")
# ]
#
# while True:
#     # отримати повідомлення від користувача
#     user_text = input("User: ")
#
#     # перевірка для кінця спілкування
#     if user_text == "":
#         break
#
#     # створити HumanMessage
#     human_message = HumanMessage(content=user_text)
#
#     # додати повідемлення в історії
#     messages.append(human_message)
#
#     # # очищення історії
#     # messages = trimmer.invoke(messages)
#
#     # отримати відповідь моделі
#     response = llm.invoke(messages)
#
#     # вивести на екран відповідь
#     print(f"AI: {response.content[0]['text']}")
#
#     # добавити response в історію спілкування
#     messages.append(response)


# Завдання 4
# Модифікуйте попереднє завдання таким чином, щоб в
# SystemMessage передавався список вивчених слів
# користувачем.
# Для цього напишіть окрему модель яка буде діставати з
# відповіді(AIMessage) усі англійські слова(вважаємо що
# користувач знає лише ті слова, про які йому сказала модель).
# Список вивчених слів треба зберігати в json файлі та
# відвантажувати при запуску програми.
# Змініть функціонал таким чином:
#  якщо користувач просить перекласти слово або фразу
# то дається переклад слова та приклад використання в
# реченні з вивченими словами
#  якщо користувач просить перекласти речення, то
# додатково пояснюється значення невідомих слів

import json
from practice_4_english_parser import chain

with open("words.json", encoding="utf-8") as file:
    learned_words = json.load(file)



messages = [
    SystemMessage(f"""
    Ти — досвідчений вчитель англійської мови.

    Вивчені користувачем слова:
    {learned_words}

    ### ІНСТРУКЦІЇ ###
    1. Якщо користувач просить перекласти слово або фразу,
    дай переклад та приклад використання, використовуючи переважно вивчені слова.
    2. Якщо користувач просить перекласти речення, дай переклад речення та коротко поясни значення невідомих слів.
    3. Пояснення роби коротко — 2-3 речення.
    4. Якщо використовуєш нові англійські слова, вони будуть автоматично додані до списку вивчених слів.
    """),
    HumanMessage("""
        Переклади слово Настрій
    """),
    AIMessage("""Ось переклад: Mood. Приклад використання: I have good mood today""")
]

while True:
    # отримати повідомлення від користувача
    user_text = input("User: ")

    # перевірка для кінця спілкування
    if user_text == "":
        break

    # створити HumanMessage
    human_message = HumanMessage(content=user_text)

    # додати повідемлення в історії
    messages.append(human_message)

    # отримати відповідь моделі
    response = llm.invoke(messages)

    # вивести на екран відповідь
    print(f"AI: {response.content[0]['text']}")

    # добавити response в історію спілкування
    messages.append(response)

    words_response = chain.invoke({
        "text": response.content
    })

    print(words_response.words)

    for word in words_response.words:
        if word not in learned_words:
            learned_words.append(word)

    with open("words.json", "w", encoding="utf-8") as file:
        json.dump(learned_words, file, ensure_ascii=False, indent=4)