# Завдання 1
# Напишіть промпт для генерації коду функції для
# вирішення певної задачі.
# Вхідні параметри – мова програмування, опис задачі
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot

# Функція пошуку найбільшого числа аналізує набір чисел, порівнює їх між собою та повертає найбільше значення.
# Це дозволяє швидко знайти максимальний елемент у списку даних.

import dotenv
import os
from langchain_google_genai import GoogleGenerativeAI
from langchain_core.prompts import PromptTemplate

# завантажити дані з .env
dotenv.load_dotenv()

api_key = os.getenv("GEMINI_API_KEY")

# # модель
llm = GoogleGenerativeAI(
    model="gemini-3.5-flash-lite",  # назва моделі
    api_key=api_key  # ключ до сервера з моделлю
)


#Zero-Shot — без прикладів
prompt = PromptTemplate.from_template("""
    Ти -- розробник.
    Твоя задача написати функцію для вирішення задачі на заданій мові програмування

    ###ВХІДНІ ДАНІ###
    ЗАДАЧА: {task}
    МОВА ПРОГРАМУВАННЯ: {programming_language}
"""
                                      )

task = ("Функція пошуку найбільшого числа аналізує набір чисел, порівнює їх між собою та повертає найбільше значення."
        "Це дозволяє швидко знайти максимальний елемент у списку даних.")

chain = prompt | llm
# спочатку формується повний текст на вхід моделі
data = {
    "task": task,
    "programming_language": "python"
}
response = chain.invoke(data)

print("Zero-Shot example")
print(response)

#  Few-shot
prompt = PromptTemplate.from_template("""
    Ти -- розробник.
    Твоя задача написати функцію для пошуку найбільшого числа на заданій мові програмування

    ###ІНСТРУКЦІЯ###:
    Функція має аналізувати набір чисел, порівнює їх між собою та повертає найбільше значення, а також підраховує
    скфльки елементів, що дорівнюють максимальному значенню було знайдено.

    Передбач ситуації, описані нижче

    Ситуація: Функція працює з набором чисел, але якщо передано набір чисел, записаний як строка -
    приклад (["1", "2","5"])
    Рішення: зроби перевірку і надай в коді можливість зміни типу даних на потрібний.

    Ситуація: Передані в функцію дані неможливо змінити на потрібний тип, приклад [1, 2, "5", "f"]
    Рішення: Створи TypeError exception

    Ситуація: Знайдено 2 значення, які відповідають максимальному, функція має повертати це максимальне значення,
     але інформувати, яка кількість елементів, що дорівнює максимальному, була знайдена
    Рішення:  приклад max_value = максимальне значення, qty_with_max_value = 2

    ### ПРИКЛАД 1 ###
    Вхідні дані: [1, 5, 3, 5]
    Очікуваний результат: max_value = 5 qty_with_max_value = 2

    ### ПРИКЛАД 2 ###
    Вхідні дані:
    ["1", "2", "5"]

    Очікуваний результат:
    max_value = 5
    qty_with_max_value = 1

    ###ВХІДНІ ДАНІ###
    МОВА ПРОГРАМУВАННЯ: {programming_language}
"""
                                      )


chain = prompt | llm
# спочатку формується повний текст на вхід моделі
data = {
    "programming_language": "python"
}
response = chain.invoke(data)

print("Few-shot example")
print(response)

# Завдання 2
# Напишіть промпт для переведення тексту з
# неформального стилю в формальний
# Вхідні параметри – текст
# Реалізуйте двома способами:
#  Zero-shot
#  Few-shot

#Zero-Shot — без прикладів
prompt = PromptTemplate.from_template("""
    Ти -- редактор статей і текстів.
    Твоя задача переробити текст {text} з неформального стилю в формальний, виправ граматичні помилки, якщо є,
    використовуй {language} мову.

    ###ВХІДНІ ДАНІ###
    ТЕКСТ: {text}
    МОВА: {language}
"""
)

text = ("""Забруднення навколишнього середовища"
Забруднення навколишнього середовища — це проблема, яку вже неможливо просто ігнорувати. Ми щодня використовуємо
пластикові пакети, пляшки та інші речі, які потім можуть роками лежати на звалищах. У повітря потрапляють
вихлопні гази автомобілів і шкидливий дим заводів. Через це погіршується повітря, відбувається забруднення води та
ґрунту.
Іноді здається, що одна людина нічого не може змінити, але це не зовсім так. Наприклад, можна менше користуватися
пластиком, сортувати сміття або не залишати його після відпочинку на природі. Також варто економити воду та
електроенергію. Природа не може нескінченно справлятися з усім смітям, яке ми створюємо.
Тому краще почати з маленьких змін уже зараз, ніж потім жити в світі, де чисте повітря стане справжньою розкішшю.""")

chain = prompt | llm
# спочатку формується повний текст на вхід моделі
data = {
    "text": text,
    "language": "українська"
}
response = chain.invoke(data)

print("Zero-Shot example")
print(response)

#  Few-shot
prompt = PromptTemplate.from_template("""
    Ти -- редактор статей і текстів.
    Твоя задача переробити текст {text} з неформального стилю в формальний, виправ граматичні помилки, якщо є,
    використовуй {language} мову. Виведи перероблений {text} у форматі, зручному для відображення в консолі.
    Обмеж довжину кожного рядка до 80 символів. Якщо текст перевищує цю довжину,
    перенось його на новий рядок по словах. Не розривай слова посередині.

    ### ПРИКЛАД###
    Неформальний:Здається, що одна людина нічого не може змінити, але це не зовсім так.

    Формальний:Існує думка, що окрема людина не здатна суттєво вплинути на стан довкілля, проте це твердження не
    є цілком правильним.

    Неформальний: Ми щодня використовуємо купу пластикових пакетів і пляшок, які потім просто лежать на звалищах.

    Формальний:Щоденне використання значної кількості пластикових пакетів і пляшок призводить до збільшення обсягів
    побутових відходів на звалищах.

    Неформальний: Природа не може нескінченно справлятися з усім сміттям, яке ми створюємо.

    Формальний: Природні екосистеми мають обмежені можливості щодо переробки та нейтралізації відходів, що утворюються
    внаслідок діяльності людини.


    ###ВХІДНІ ДАНІ###
    ТЕКСТ: {text}
    МОВА: {language}
"""
)

text = ("""Забруднення навколишнього середовища"
Забруднення навколишнього середовища — це проблема, яку вже неможливо просто ігнорувати. Ми щодня використовуємо
пластикові пакети, пляшки та інші речі, які потім можуть роками лежати на звалищах. У повітря потрапляють
вихлопні гази автомобілів і шкидливий дим заводів. Через це погіршується повітря, відбувається забруднення води та
ґрунту.
Іноді здається, що одна людина нічого не може змінити, але це не зовсім так. Наприклад, можна менше користуватися
пластиком, сортувати сміття або не залишати його після відпочинку на природі. Також варто економити воду та
електроенергію. Природа не може нескінченно справлятися з усім смітям, яке ми створюємо.
Тому краще почати з маленьких змін уже зараз, ніж потім жити в світі, де чисте повітря стане справжньою розкішшю.""")

chain = prompt | llm
# спочатку формується повний текст на вхід моделі
data = {
    "text": text,
    "language": "українська"
}
response = chain.invoke(data)

print("Few-shot example")
print(response)

# Завдання 3
# Прочитайте файл data\lesson10\products.txt з описом
# Практичне завдання
# послуг СПА. Напишіть промпт для рекомендації послуги
# виходячи з запиту користувача
# Вхідні параметри – опис товарів, запит користувача
# Реалізуйте двома способами:
#  Zero-shot
#  Chain of Thoughts

with open("data/lesson10/products.txt", encoding="utf-8") as file:
    products = file.read()

request = input(
    "Вкажіть, на яку частину тіла Ви хотіли б отримати процедуру,\n"
    "якщо є побажання щодо тривалості процедури,\n"
    "і до якої ціни Ви розраховуєте отримати послугу: "
)

simple_template = PromptTemplate.from_template("""
В документі наведено опис процедур СПА-салону:

{products}

Запит відвідувача:

{request}
На основі опису процедур і запиту відвідувача обери одну процедуру,
яка найбільше йому підходить.

""")

simple_chain = simple_template | llm

print("=== Zero-shot ===")

result = simple_chain.invoke({
    "products": products,
    "request": request
})

print(result)

cot_template = PromptTemplate.from_template("""
В документі наведено опис процедур СПА-салону:

{products}

Запит відвідувача:

{request}
На основі опису процедур і запиту відвідувача обери одну процедуру,
яка найбільше йому підходить.
Виконай підбір процедури чітко за таким алгоритмом:
1. Визнач, на яку частину тіла відвідувач хоче отримати процедуру.
2. Відбери процедури, тривалість яких не перевищує бажану відвідувачем (якщо тривалість у запиті не вказана, 
пропусти цей критерій).
3. Врахуй ціновий критерій:
   - Якщо у запиті вказана конкретна сума/бюджет, пропонуй процедури НЕ вище цієї ціни.
   - Якщо ціна у запиті НЕ вказана, пропонуй варіанти, починаючи з найдорожчих.


Надай відповідь у такому форматі:
- Бажана частина тіла: ...
- Бажана тривалість та ціна (з запиту): ...
- Обрана процедура: (Назва, тривалість, ціна)
- Обґрунтування: чому обрано саме її.
""")

cot_chain = cot_template | llm
print("\n=== З CoT ===")
result = cot_chain.invoke({
    "products": products,
    "request": request
})
print(result)